       IDENTIFICATION DIVISION.
       PROGRAM-ID. INCOLLEGE.
       AUTHOR. Ian Koratsky.
       DATE-WRITTEN. 9/8/2026.

       PROCEDURE DIVISION.
           CALL 'INCOLLEGE-CORE' 
               USING "InCollege-Input.txt" "InCollege-Output.txt".
           STOP RUN.

       
